package com.example.pta;

public class RulesClass {

    public  static final String rules1 = "আসসালামু আলাইকুম, EARN BY LEARN এপে আপনাকে স্বাগতম। বাংলাদেশে এই প্রথম আমরাই নিয়ে এসেছি কুইজ খেলার মাধ্যমে টাকা কামানোর সুযোগ। সম্পূর্ণ ২০০০০ (বিশ হাজার) টাকা জেতার সুবর্ণ সুযোগ থাকছে আপনাদের সামনে। সাথে রেফারেল করে জিতে নিতে পারেন সর্বনিম্ন ২০ (বিশ)টাকা থেকে সর্বোচ্চ ১০০০০ (দশ হাজার) টাকা। সব কিছুর বিস্তারিত নিচে দেয়া হল।\n" +
            "\n" +
            "\n" +
            "যেভাবে নিজের একাউন্ট সেটাপ করবেনঃ \n" +
            "\n" +
            "১) শুরুতে EARN BY LEARN এপটি ডাউনলোড ও ইন্সটল করা শেষে নিজের নাম,ইমেইল আইডি ও নিজের ব্যক্তিগত মোবাইল নাম্বার সরবরাহ করে লগিন করবেন।\n" +
            "\n" +
            "২) এরপর প্রোফাইল আইকনটিতে ক্লিক করবেন (নিচের একদম বাম পাশের আইকন)।\n" +
            "\n" +
            "৩) প্রোফাইলে ঢুকে \"my wallet\" নামের বাটনে ক্লিক করবেন";


    public  static final String rules2 = "\n" +
            "৪) my wallet বাটনে ক্লিক করার পর আপনার প্রথম কাজ হবে গেম খেলার জন্য অন্তত ১০ টাকা Deposit করা। কারণ আমাদের সর্বনিম্ন এন্ট্রি ফি ১০ টাকা। এছাড়াও Daily match এ কিছু গেম খেলতে ২০ টাকা এন্ট্রি ফি এবং আমাদের মূল আকর্ষণ Weekly match এর এন্ট্রি ফি ১০০ টাকা থাকবে। তাই সেসব ম্যাচ খেলতে হলে আগে my wallet এ অন্ততপক্ষে যে ম্যাচ খেলতে চাচ্ছেন সে ম্যাচের এন্ট্রি ফি সমপরিমাণ  টাকা Deposit করতে হবে,অন্যথায় গেমে এন্ট্রি করা যাবে না।\n" +
            "\n" +
            "ডিপোজিটের পদ্ধতিঃ my wallet এ ঢুকার পর স্ক্রিনে EARN BY LEARN এর যে বিকাশ নম্বরটি দেখবেন তাতে আপনার সুবিধামত টাকা পাঠাবেন। তারপর আপনি যত টাকা পাঠিয়েছেন তা, যে বিকাশ নম্বর থেকে পাঠিয়েছেন সেই নম্বর এবং transaction id ঠিকঠাকমতো বসিয়ে সাবমিটে ক্লিক করবেন। এরপর আমাদের সার্ভারের মাধ্যমে আমরা আপনাদের my wallet এ সেই পরিমাণ টাকা পাঠিয়ে দিব।\n" +
            "\n" +
            "৫) my wallet এ পর্যাপ্ত পরিমাণ টাকা Deposit করার পর এবার আপনি চাইলে যেকোনো ম্যাচে এন্ট্রি করতে পারবেন। যদি আপনার my wallet এ ম্যাচে এন্ট্রি করার মত পর্যাপ্ত পরিমাণ টাকা না থাকে তবে পুনরায় আপনাকে টাকা Deposit  করতে হবে\n" +
            "\n" +
            "\n" +
            "\n" +
            "কিভাবে খেলবেনঃ \n" +
            "\n" +
            "১) আমাদের এই এপে আছে দুই ধরণের ম্যাচ। একটি Daily match, অপরটি Weekly match \n" +
            "\n" +
            "২) প্রথমে আসি Daily match এ। Daily match এ প্রতিদিন দুটো করে ম্যাচ থাকবে। একটির এন্ট্রি ফি থাকবে ১০ টাকা, যেখানে প্রশ্ন থাকবে মাত্র ৫ টি। অপরটির এন্ট্রি ফি থাকবে ২০ টাকা, যেখানে প্রশ্ন থাকবে ১০ টি। উভয়টিতেই পার্টিসিপেন্ট হতে হবে  ১০ জন,নইলে খেলা বাতিল বলে বিবেচিত হবে এবং আপনি যে এন্ট্রি ফি দিয়েছিলেন তা আবার আপনার my wallet এ অটোমেটিক Deposit হয়ে যাবে।\n" +
            "\n" +
            "এন্ট্রি ফি ১০ টাকার ম্যাচ প্রতিদিন দুপুর ১২ টা থেকে ৪ টা পর্যন্ত খোলা থাকবে,তবে এক্সামের সময় থাকবে কেবল ২ মিনিট। যিনি এই এক্সামে প্রথম হবেন তিনি পাবেন ৫০ টাকা প্রাইজমানি।\n" +
            "\n" +
            "এন্ট্রি ফি ২০ টাকার ম্যাচ প্রতিদিন বিকেল ৫ টা থেকে রাত ৮ টা পর্যন্ত খোলা থাকবে,তবে এক্সামের সময় কেবল ৫ মিনিট। যিনি এই এক্সামে প্রথম হবেন তিনি পাবেন ১০০ টাকা প্রাইজমানি।\n" +
            "\n" +
            "\n" +
            "৩) এবার আসা যাক আমাদের মূল আকর্ষণ Weekly match নিয়ে। Weekly match এ এন্ট্রি ফি ১০০ টাকা,যেখানে প্রশ্ন থাকবে ২০ টি,পার্টিসিপেন্ট হতে হবে  ৫০০ জন। যদি ৫০০ জন পার্টিসিপেন্ট না পাওয়া যায় তবে কর্তৃপক্ষ চাইলে ম্যাচ বাতিল করে দিতে পারবেন। সেক্ষেত্রে যারা এন্ট্রি ফি দিয়েছিলেন তাদের সবার my wallet এ আবার সমপরিমাণ টাকা অটোমেটিক Deposit হয়ে যাবে। Weekly match হবে প্রতি শুক্রবার। সকাল ১০ টা থেকে ১০ টা ৩০ মিনিট পর্যন্ত খোলা থাকবে,তবে এক্সামের সময় ১০ মিনিট। যিনি এই এক্সামে প্রথম হবেন তিনিই পাবেন সম্পূর্ণ ২০০০০ ( বিশ হাজার) টাকা।\n" +
            "এখানে উল্লেখ্য যে, Weekly match এর প্রস্তুতির জন্য প্রতি বৃহঃস্পতিবার সকাল ১২ টায় ১০০ টি প্রশ্ন সংবলিত পিডিএফ দেয়া হবে,যার ভিতর থেকেই এক্সামে আসবে ২০ টি প্রশ্ন।\n" +
            "\n" +
            "\n" +
            "যেভাবে নির্ধারিত হবেন উইনার/বিজয়ীঃ\n" +
            "\n" +
            "উইনার সাধারণত নির্ধারিত হয় নম্বরের ভিত্তি তে,যিনি সবচেয়ে বেশি নম্বর পান তিনিই হন বিজয়ী। কিন্তু আমাদের এখানে রয়েছে এর ব্যতিক্রম। আমাদের এখানে আপনাকে নির্দিষ্ট সময় দেয়া থাকবে। যিনি সবচেয়ে বেশি সময় বাকি রেখেই এক্সাম শেষ করতে পারবেন তিনিই হবেন বিজয়ী। অনেকে ভাবছেন তাহলে চোখ বন্ধ করেই দাগিয়ে দিবেন! না তা হবে না। কেননা, প্রতিটা ভুল উত্তরের জন্য কাটা যাবে সময়। প্রতিটা ভুল উত্তরের জন্য কাটা পড়বে ২০ সেকেন্ড করে,যা সব ম্যাচের জন্যই প্রযোজ্য।\n" +
            "\n" +
            "\n" +
            "\n" +
            "প্রাইজমানিঃ \n" +
            "১) Daily match, ১০ টাকার এন্ট্রি ফি'র প্রাইজমানি ৫০ টাকা\n" +
            "২) Daily match, ২০ টাকার এন্ট্রি ফি'র প্রাইজমানি ১০০ টাকা\n" +
            "৩) Weekly match এর প্রাইজমানি ২০০০০ (বিশ হাজার)  টাকা\n";



    public  static final String rules3 = "\n" +
            "রেফারেল সিস্টেমঃ\n" +
            "আমাদের এখানে একজন রেফার করলেই পাবেন ২০ টাকা। তাহলে হিসাব করে দেখুন,৫ জন রেফার করলেই পাবেন ১০০ টাকা,১০০ জন রেফার করলেই  ২০০০ (দুই হাজার) টাকা, ৫০০ জন রেফার করলেই ১০০০০(দশ হাজার) টাকা। অর্থ্যাত,সর্বনিম্ন ২০ টাকা থেকে সর্বোচ্চ ১০০০০ (দশ হাজার) টাকা জেতার সুযোগ শুধু রেফার করেই!\n" +
            "\n" +
            "রেফার যেভাবে করবেনঃ \n" +
            "\n" +
            "আপনাকে মূলত তিনটি স্টেপ ফলো করতে হবে এই ক্ষেত্রে।\n" +
            "\n" +
            "১) আপনি যাকে বা যাদেরকে রেফার করতে চান তাদেরকে প্রথমে আমাদের গ্রুপ, EARN BY LEARN এ জয়েন করাবেন\n" +
            "\n" +
            "২) তাদেরকে যেকোনো একটি weekly match  এ রেজিস্ট্রেশন করাবেন।\n" +
            "\n" +
            "৩) এরপর আমাদের EARN BY LEARN গ্রুপে রেফারেল নিয়ে করা পোস্টের কমেন্টে যাদেরকে রেফার করিয়েছেন তাদের ইউজার নেম লিখে কমেন্ট করবেন। অথবা ব্যক্তিগত ভাবে গ্রুপের এডমিন Chowdhury Abdullah Al Mushfiq কে ইনবক্সে ম্যাসেজ করতে পারেন।\n" +
            "\n" +
            "এরপরেই আপনার \"my wallet\" এ ইন্সট্যান্ট টাকা deposit করে দিব আমরা। যা withdraw করতে পারবেন weekly match শেষ হওয়ার সাথে সাথে\n" +
            "\n" +
            "শর্ত সমূহঃ\n" +
            "\n" +
            "১) এক্সামের যে সময়গুলো দেয়া হয়েছে তার মধ্যে যদি কেউ এক্সাম দিতে না পারেন তবে তার দায়ভার EARN BY LEARN কর্তৃপক্ষ নিবে না।\n" +
            "\n" +
            "২) যেকোনো ম্যাচ যেকোনো সময় বাতিল করার ক্ষমতা রাখে EARN BY LEARN কর্তৃপক্ষ। সেক্ষেত্রে পার্টিসিপেন্টদের এন্ট্রি ফি তাদের my wallet এ অটোমেটিক Deposit হয়ে যাবে";

}
